{"posts":[{"title":"First Blog","text":"这是我发布的第一篇博客，网站还在完善中，以后会在这里分享我的日常工作和学习生活 今日分享 首先贴一下自己最近很喜欢的一句话 \"Everyone must choose one of two pains: The pain of discipline or the pain of regret.\" ——Jim Rohn 碎碎念 经历了两年的大学生活，成功让我结束了高考结束后对大学的无限美好畅想。现在正在着手准备考研，目标院校暂时还没有定下来，80%的决心准备考清华，余下的20%是害怕自己考不上没有什么退路。二战是没有怎么考虑的，做事情一次做出个结果最好 大家都说考清华难，其实我不太清楚难在哪里(可能是因为我还没开始)，本身对困难就有一些迟钝，然后性格里又加了一点乐天派，做决定的时候还是挺满怀希望的 总结一下我的大学前两年：大一的时候懵懵懂懂，成绩还挺可以，然后什么都想试试，被一些技术性的组织拒绝了很多次，也让很多人认识了我；大二的时候一心奔比赛去了，这段时间中自己开始对一些比赛祛魅，也对一些成绩很好的人祛魅。成绩也没有大一的好，但其实也没有很差，也让我慢慢没有保研的想法了，遂准备考研 最近的状态 最近自己的行动力开始变差，只是仰望星空，而没有脚踏实地，这样很不好，未来是属于实干家的 考驾照去了，晒得很黑，目前处于一种考一次挂一次的状态，拿证的路还很漫长最近喜欢玩一个游戏，准备在游戏里攒钱建房子，锻炼自己的动手能力和空间利用能力准备开始学数学和英语，做做题，取得一些看得见的努力成果，并且要分离游戏时间和学习时间，明天的Blog要汇报一下自己的学习成果 并且这几天一直在看英文原著，有点看厌了书，要做点不同的事情换个大脑区域工作 近期感悟 不要给自己贴标签。要把自己的性质落实在具体的词语和事件上，而不是空洞的，笼统的，概括性的标签上。比如，我在整理房间上有些懒惰，但这并不能概括性的给自己下结论说我是P人做事情要以需求为导向，而不是看别人都在做什么。就像考驾照一样，目前看来6年内我是基本上开不上车的，但是看大家都建议考驾照我就报了一个，天天在驾校里练车花费很多时间而且一直考不过去，尤其大学还是寒暑假有空，但那又恰好是驾校人最多的时候，想想真是折磨还有一个忘记了。。。 最后 致敬每一个双手向下的人，就像农民叔叔和阿姨，他们都是把论文写在祖国大地的人。 第一次写Blog，MarkDown语法也不是很熟练，以后常写希望会取得明显进步！ Last but not least，愿每个身边的人诸事顺利，愿自己可以每天笑着唱不同的歌","link":"/2024/07/27/First-Blog/"},{"title":"Second","text":"今天活在虚拟里 ❝ The last time, I have learned 今日总结 上午单词打卡后开始在游戏里建房子，教程视频0.2倍速看得好认真，感觉其实不同方面踩坑的原因都很相似得莫名其妙，跟着教程一步一步来的，突然在某一个环节就不一样了，其实原因不在自己当下的操作，而取决于系统环境等等自己并未注意到的地方，安啦。 所幸在0.2倍速盯帧的程度看教程，这个房子还是建的蛮顺利的。明天准备装修一下再入住（再次感叹游戏人物真的好幸福） 上午下午一直在沉迷游戏，偶尔看了一下网站，把头像之类的改过来了，但是有个图片加载出问题了，以后再解决！晚上的时候学了python的正则表达式 正则表达式 只看了re.research,语言学习一定要多重复，不然很容易忘，我的C++是这样的orz。想到科研训练还要学MySQL,这几天一定学 #正则表达式import&nbsp;rere.search(r'AN',&nbsp;'GUAN')#通配符(.)#&nbsp;\\可以剥夺元字符的特殊能力，也可以使普通字符拥有特殊能力re.search(r'\\d\\d\\d\\.\\d\\d\\d\\.\\d\\d\\d\\.\\d\\d\\d',&nbsp;'other112.187.244.253')re.search(r'[aeiouAEIOU]',&nbsp;\"GUaN\")re.search(r'[0-9][0-9][0-9]',&nbsp;'I&nbsp;love&nbsp;999')#重复匹配re.search(r'ab{3}c','abbbc')re.search(r'ab{3,5}c',&nbsp;'abbbbbc')#匹配0~255的数字re.search(r'[0-1]\\d\\d|2[0-4]\\d|25[0-5]',&nbsp;'188')#匹配ip地址re.search(r'(([01]{0,1}\\d{0,1}\\d|2[0-4]\\d|25[0-5])\\.){3}([01]{0,1}\\d{0,1}\\d|2[0-4]\\d|25[0-5])',&nbsp;'other192.168.1.1other') 不懂的可以询问ChatGpt,不过要仔细甄别内容，原理性的或许它能说好，但是结论性的还是很容易出错。 先水到这里，再看看东西就要睡觉了，今日给自己的建议：不要为别人的事情烦心（盖被子）","link":"/2024/08/01/Second/"},{"title":"Third","text":"这两天在看书在偷懒，其实一直有更博客的想法，但是鉴于自己一直在记流水账，就对日更没什么想法了(￣▽￣)\" 技术成长 把入门学python的书看完了，最近在学一本以C语言为主体的算法书，但是里面的代码我都在换成C++敲，习题也有做，不会的题目浏览器一搜就有，看不懂的代码先是仔细看两遍，再看不懂就求助ChatGpt了 看起来的时间管理，其实都是自我管理 最近看的书 这几天在看一本国外的小说，有很多推荐序，在网上也能找到几篇书评，对我而言这本书我还是批判性的，满分10分打个7分差不多。下面是一段书摘： Eventually, you deal with something for long enough that it becomes such an intrinsic part of you, and you can’t imagine yourself without it. You accept it, maybe because you think you deserve it but also because you’re scared that if you tried to change it, it wouldn’t work. It feels easier to live in that somber place because you don’t know who you are otherwise, and you’re worried about putting in all that effort without a guaranteed outcome.” 人们常常会对熟悉的事物感到舒适，即使它并不完全是积极的。这种舒适可能源于对未知的恐惧，或者对自己改变和适应新事物能力缺乏信心。 改变的过程确实可能令人畏惧，而且没有保证它会带来更好的结果。然而，个人成长往往涉及走出我们的舒适区，面对改变带来的不确定性。重要的是要记住，虽然结果可能无法保证，但这个过程本身可以是变革性的，带来新的洞察力和自我发现。 今天我在做什么 今天准备学数一的概率论和人工智能基础，but到现在还说是准备那就是还没开始(ˉ▽ˉ；)... 原因有三： 昨天看书把平板看没电了，今天充了一上午才把电充满时间快得很莫名其妙，上午边摸鱼边学算法就一下过完了，下午有点困就不想动脑筋（我的错）又想盖房子了，网站找了一大堆教程没遇到特别喜欢的，然后就自己找了图纸准备建 感觉人与人之间地参差就好像楼房之间那样，我在游戏里就没有建成的漂亮房子在现实中却能有很多人切切实实地住着 我也要很努力，以后怎么说也要建两栋大别墅( •̀ ω •́ )y 对于短剧 情节虚构，请勿养成不良价值观 最后 别人好像很厉害，但自己其实也不错，生活容错率挺高的，现在开始一点都不晚。 想过让自己重生的剧情，但重来一辈子我还是想不到除了考试和竞赛赚钱自己还能做什么，所以要多经历，这样重生后选择就更多了。另外，我对现状也有80%的满意，等到以后自己心里又有另一套剧本了，再酷酷重生吧&lt;(￣︶￣)↗[GO!]","link":"/2024/08/01/Third/"}],"tags":[{"name":"self-talking","slug":"self-talking","link":"/tags/self-talking/"}],"categories":[],"pages":[]}